#### Sreelal H

### Evaluate the dataset of the Summer Olympics, London 2012

In [1]:
import pandas as pd

In [21]:
file=pd.read_excel("Olympic 2012 Medal Tally.xlsx",header=[1,2])

In [22]:
df=pd.DataFrame(file)

In [23]:
df.head()

  Unnamed: 0_level_0            Country       Country Code               Year  \
  Unnamed: 0_level_1 Unnamed: 1_level_1 Unnamed: 2_level_1 Unnamed: 3_level_1
0                NaN      Great Britain                GBR               2012
1                NaN             China                 CHN               2012
2                NaN             Russia                RUS               2012
3                NaN      United States                 US               2012
4                NaN              Korea                KOR               2012

  Medal Tally
         Gold Silver Bronze
0          29     17     19
1          38     28     22
2          24     25     32
3          46     28     29
4          13      8      7

In [34]:
df.iloc()